In [3]:
pip install pandas

Requirement already satisfied: pandas in c:\users\prera\appdata\local\programs\python\python311\lib\site-packages (1.5.3)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\prera\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\prera\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2022.7.1)
Requirement already satisfied: numpy>=1.21.0 in c:\users\prera\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.24.2)
Requirement already satisfied: six>=1.5 in c:\users\prera\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [4]:
import psycopg2
import pandas as pd

In [5]:
def create_database():
    conn= psycopg2.connect("host=localhost dbname=postgres user=postgres password=@Abhinav98")
    conn.set_session(autocommit=True)
    cur=conn.cursor()
    
    cur.execute("DROP DATABASE IF EXISTS forbes")
    cur.execute("CREATE DATABASE forbes")
    
    conn.close()
    
    conn= psycopg2.connect("host=localhost dbname=forbes user=postgres password=@Abhinav98")
    cur=conn.cursor()
    
    return cur, conn

In [6]:
def drop_tables(cur, conn):
    for query in drop_table_queries:
        cur.execute(query)
        conn.commit()

In [7]:
def create_tables(cur, conn):
    for query in create_table_queries:
        cur.execute(query)
        conn.commit()

In [8]:
ForbesRich= pd.read_csv("forbes_dataset_2022/forbes_rich_2022.csv")

In [9]:
ForbesRich.head()

,rank,personName,age,finalWorth,category,source,country,state,city,organization,selfMade,gender,birthDate,title,philanthropyScore,bio,about
0,1,Elon Musk,50.0,219000,Automotive,"Tesla, SpaceX",United States,Texas,Austin,Tesla,True,M,6/28/1971,CEO,1.0,Elon Musk is working to revolutionize transpor...,Musk was accepted to a graduate program at Sta...
1,2,Jeff Bezos,58.0,171000,Technology,Amazon,United States,Washington,Seattle,Amazon,True,M,1/12/1964,Entrepreneur,1.0,Jeff Bezos founded e-commerce giant Amazon in ...,"Growing up, Jeff Bezos worked summers on his g..."
2,3,Bernard Arnault & family,73.0,158000,Fashion & Retail,LVMH,France,NaN,Paris,LVMH Moët Hennessy Louis Vuitton,False,M,3/5/1949,Chairman and CEO,NaN,Bernard Arnault oversees the LVMH empire of so...,"Arnault apparently wooed his wife, Helene Merc..."
3,4,Bill Gates,66.0,129000,Technology,Microsoft,United States,Washington,Medina,Bill & Melinda Gates Foundation,True,M,10/28/1955,Cofounder,4.0,Bill Gates turned his fortune from software fi...,"When Gates was a kid, he spent so much time re..."
4,5,Warren Buffett,91.0,118000,Finance & Investments,Berkshire Hathaway,United States,Nebraska,Omaha,Berkshire Hathaway,True,M,8/30/1930,CEO,5.0,"Known as the ""Oracle of Omaha,"" Warren Buffett...","Buffett still lives in the same Omaha, Nebrask..."

In [10]:
ForbesRich_clean= ForbesRich[['rank', 'personName', 'age', 'finalWorth', 'category', 'source', 'about']]

In [11]:
ForbesRich_clean.head()

,rank,personName,age,finalWorth,category,source,about
0,1,Elon Musk,50.0,219000,Automotive,"Tesla, SpaceX",Musk was accepted to a graduate program at Sta...
1,2,Jeff Bezos,58.0,171000,Technology,Amazon,"Growing up, Jeff Bezos worked summers on his g..."
2,3,Bernard Arnault & family,73.0,158000,Fashion & Retail,LVMH,"Arnault apparently wooed his wife, Helene Merc..."
3,4,Bill Gates,66.0,129000,Technology,Microsoft,"When Gates was a kid, he spent so much time re..."
4,5,Warren Buffett,91.0,118000,Finance & Investments,Berkshire Hathaway,"Buffett still lives in the same Omaha, Nebrask..."

In [12]:
ForbesCompany= pd.read_csv("forbes_dataset_2022/forbes_companies_2022.csv")

In [13]:
ForbesCompany.head()

,rank,global company,country,sales,profit,assets,market value
0,1,Berkshire Hathaway,United States,$276.09 B,$89.8 B,$958.78 B,$741.48 B
1,2,ICBC,China,$208.13 B,$54.03 B,"$5,518.51 B",$214.43 B
2,3,Saudi Arabian Oil Company (Saudi Aramco),Saudi Arabia,$400.38 B,$105.36 B,$576.04 B,"$2,292.08 B"
3,4,JPMorgan Chase,United States,$124.54 B,$42.12 B,"$3,954.69 B",$374.45 B
4,5,China Construction Bank,China,$202.07 B,$46.89 B,"$4,746.95 B",$181.32 B

In [14]:
print(ForbesCompany)

      rank                                      global company        country  \
0         1                                 Berkshire Hathaway  United States
1         2                                               ICBC          China
2         3           Saudi Arabian Oil Company (Saudi Aramco)   Saudi Arabia
3         4                                     JPMorgan Chase  United States
4         5                            China Construction Bank          China
...     ...                                                ...            ...
1995   1995  Shenzhen Feima International Supply Chain Co.,...          China
1996   1997                                               NMDC          India
1997   1997                         Sichuan Changhong Electric          China
1998   1999                              Credit Bank of Moscow         Russia
1999   1999                                 Satellite Chemical          China

         sales     profit        assets market value
0     $276.09 B    $89.8 B    $958.78 B    $741.48 B
1     $208.13 B   $54.03 B  $5,518.51 B    $214.43 B
2     $400.38 B  $105.36 B    $576.04 B  $2,292.08 B
3     $124.54 B   $42.12 B  $3,954.69 B    $374.45 B
4     $202.07 B   $46.89 B  $4,746.95 B    $181.32 B
...         ...        ...          ...          ...
1995      $37 M    $1.41 B       $166 M      $1.14 B
1996    $3.52 B    $1.41 B      $5.71 B       $6.4 B
1997   $15.72 B    $53.1 M     $12.11 B      $1.96 B
1998    $2.53 B   $370.1 M     $45.15 B      $2.06 B
1999    $4.41 B   $931.3 M      $7.64 B      $9.52 B

[2000 rows x 7 columns]

In [15]:
ForbesCompany.columns

Index(['rank ', 'global company', 'country', 'sales ', 'profit ', 'assets',
       'market value'],
      dtype='object')

In [16]:
ForbesCompany= ForbesCompany.drop(['sales '], axis=1)

In [17]:
ForbesCompany.head()

,rank,global company,country,profit,assets,market value
0,1,Berkshire Hathaway,United States,$89.8 B,$958.78 B,$741.48 B
1,2,ICBC,China,$54.03 B,"$5,518.51 B",$214.43 B
2,3,Saudi Arabian Oil Company (Saudi Aramco),Saudi Arabia,$105.36 B,$576.04 B,"$2,292.08 B"
3,4,JPMorgan Chase,United States,$42.12 B,"$3,954.69 B",$374.45 B
4,5,China Construction Bank,China,$46.89 B,"$4,746.95 B",$181.32 B

In [83]:
conn= psycopg2.connect("host=localhost dbname=forbes user=postgres password=@Abhinav98")
cur=conn.cursor()

In [84]:
ForbesRich_clean.columns

Index(['rank', 'personName', 'age', 'finalWorth', 'category', 'source',
       'about'],
      dtype='object')

In [20]:
forbes_rich_create= ("""CREATE TABLE IF NOT EXISTS forbesRich(
rank INT not null,
personName VARCHAR PRIMARY KEY,
age INT,
finalWorth VARCHAR,
category VARCHAR,
source VARCHAR,
about VARCHAR)""")

In [21]:
cur.execute(forbes_rich_create)
conn.commit()

In [78]:
ForbesCompany.columns

Index(['rank ', 'global company', 'country', 'profit ', 'assets',
       'market value'],
      dtype='object')

In [85]:
forbes_company_create= ("""CREATE TABLE IF NOT EXISTS forbescompany(
rank INT,
global_company VARCHAR,
country VARCHAR,
profit  VARCHAR,
assets VARCHAR,
market_value VARCHAR);""")

In [86]:
cur.execute(forbes_company_create)
conn.commit()

In [87]:
ForbesRich_clean.columns

Index(['rank', 'personName', 'age', 'finalWorth', 'category', 'source',
       'about'],
      dtype='object')

In [64]:
forbes_rich_insert = ("""INSERT INTO forbesrich(
rank,
personname,
age,
finalworth,
category,
source,
about)
VALUES (%s, %s, %s, %s, %s, %s, %s)
""")

In [95]:
forbes_company_insert= ("""INSERT INTO forbescompany(
rank,
global_company,
country,
profit,
assets,
market_value)
VALUES (%s, %s, %s, %s, %s, %s)
""")

In [96]:
for i, row in ForbesCompany.iterrows():
    cur.execute(forbes_company_insert, list(row))

In [105]:
','.join(list(ForbesCompany.columns))

'rank ,global_company,country,profit ,assets,market_value'

In [104]:
ForbesCompany.rename(columns={'global company':'global_company','market value':'market_value'},inplace=True)

In [97]:
conn.commit()

In [99]:
def execute_many(conn, df, table):
    """
    Using cursor.executemany() to insert the dataframe
    """
    # Create a list of tupples from the dataframe values
    tuples = [tuple(x) for x in df.to_numpy()]
    # Comma-separated dataframe columns
    cols = ','.join(list(df.columns))
    # SQL quert to execute
    query  = "INSERT INTO %s(%s) VALUES(%%s,%%s,%%s,%%s,%%s,%%s)" % (table, cols)
    cursor = conn.cursor()
    try:
        cursor.executemany(query, tuples)
        conn.commit()
    except (Exception, psycopg2.DatabaseError) as error:
        print("Error: %s" % error)
        conn.rollback()
        cursor.close()
        return 1
    print("execute_many() done")
    cursor.close()

In [100]:
conn.closed

0

In [110]:
execute_many(conn, ForbesCompany, 'forbesC1')

execute_many() done

In [108]:
forbes_company1_create= ("""CREATE TABLE IF NOT EXISTS forbesC1(
rank INT,
global_company VARCHAR,
country VARCHAR,
profit  VARCHAR,
assets VARCHAR,
market_value VARCHAR);""")

In [109]:
cur.execute(forbes_company1_create)
conn.commit()